#include <stdio.h>//підключення бібліотек
#include<locale.h>
#include<math.h>
int V , S;// оголошення глобальної змінної
// оголошення функції
main() {
int a; /* оголошення локальних
змінних */
setlocale (LC_CTYPE,"ua"); /*підключення
підтримки кирилиці української мови*/
printf("\n довжина ребра  a="); /*
виведення даних*/
scanf("%d",&a);/*введення даних*/
V = pow(a,3);
S = 6 *pow(a,2);
printf("a \t V \t S \n");
printf("Сторона куба=%d \n", a);
printf("Об'єм куба= %d\n", V);
printf("Площа рівної поверхнф куба = %d\n", S);
return 0;
}